{
  "urlPreviews": {
    "https://github.com/zineland/zine": [
      "Zine - an simple and opinionated tool to build your own magazine.",
      "GitHub - zineland/zine: Zine - an simple and opinionated tool to build your own magazine."
    ],
    "https://mp.weixin.qq.com/s/Y2A7-Ui2nzUgodkEbgR6lQ": [
      "【年度公司】Hashicorp：160亿美金的开源标杆，15000字的研究笔记，2021年不遗憾",
      "2021年最后一天，看看Hashicorp怎样用十年的坎坷，打造了一家了不起的公司。产品战略，开源商业化，全球社区，以及，坚持理想主义那些事儿。"
    ],
    "https://retool.com/blog/series-c/": [
      "Series C: Raising less money at lower valuations",
      "Many startups today fundraise with the goal of getting the most money at the highest valuation possible. But at Retool, we decided to take the opposite strategy."
    ],
    "https://www.gv.com/news/core-os-founders/": [
      "CoreOS Co-Founders Alex Polvi and Brandon Philips on Tackling Enormous Opportunities | GV",
      "One of the more fulfilling aspects of my job is connecting new founders with experienced mentors who can help them grow. CoreOS founders Alex Polvi and Brandon Philips are among the most requested ope"
    ],
    "https://www.hashicorp.com/blog/a-new-chapter-for-hashicorp": [
      "A New Chapter for HashiCorp",
      "As we officially enter the public markets, we plan to continue to do what we think we do best: solving problems for our end users."
    ],
    "https://www.hashicorp.com/state-of-the-cloud": [
      "HashiCorp State of Cloud Strategy Survey",
      "Multi-cloud has become the de facto standard operations model for IT organizations of all sizes, in all regions, and every industry."
    ],
    "https://www.nomadproject.io/docs/nomad-vs-kubernetes": [
      "Nomad vs. Kubernetes | Nomad by HashiCorp",
      "Comparison between Nomad and Kubernetes"
    ],
    "https://www.redhat.com/en/blog/faq-red-hat-acquire-coreos": [
      "FAQ: Red Hat to acquire CoreOS",
      "What is being announced?On Jan. 30, 2018, Red Hat announced that it has signed a definitive agreement to acquire CoreOS, Inc. The acquisition is subject to certain customary closing conditions.Q. "
    ],
    "https://www.suse.com/c/rancher_blog/rancher-desktop-1-0-0-has-arrived/": [
      "Rancher Desktop 1.0.0 Has Arrived | SUSE Communities",
      "We are happy to announce the 1.0.0 release of Rancher Desktop. This release has been months in the making since development on Rancher Desktop began. After starting small and learning what users neede"
    ],
    "https://www.suse.com/c/rancher_blog/suse-enters-into-definitive-agreement-to-acquire-rancher-labs/": [
      "SUSE Enters Into Definitive Agreement to Acquire Rancher Labs | SUSE Communities",
      "Read our free white paper: How to Build a Kubernetes Strategy Download Now I’m excited to announce that Rancher has signed a definitive agreement to be acquired by SUSE. Rancher is the most widely u"
    ]
  }
}